---
type: IRevisionsOnSheetUIServer
namespace: Autodesk.Revit.UI
version: 2024
members: 1
tags: [revit-api, class]
---

# IRevisionsOnSheetUIServer

`Autodesk.Revit.UI.IRevisionsOnSheetUIServer` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | ShowDialog | 2024 | `bool ShowDialog ( RevisionsOnSheetUIServiceData data )` |